In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('C:/Users/Admin/Downloads/Demo_Datasets/Demo Datasets/Lesson 3/SalaryGender.csv')

In [13]:
df.head()

   Salary  Gender  Age  PhD
0   140.0       1   47    1
1    30.0       0   65    1
2    35.1       0   56    0
3    30.0       1   23    0
4    80.0       0   53    1

In [10]:
salary = np.array(df['Salary'])
gender = np.array(df['Age'])
age = np.array(df['Age'])
phd = np.array(df['PhD'])

In [14]:
df.shape

(100, 4)

In [15]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.iloc[:1,:2]

   Salary  Gender
0   140.0       1

In [20]:
df['Gender'].unique()

array([1, 0], dtype=int64)

In [27]:
df.mode(axis=0)

   Salary  Gender  Age  PhD
0    30.0       0   60  0.0
1     NaN       1   65  NaN